bench-results/fs_redis_fdp_enabled_everysec/summary_1.txt
====== SET ======
  28835840 requests completed in 606.14 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.143 milliseconds (cumulative count 1)
50.000% <= 0.783 milliseconds (cumulative count 14447677)
75.000% <= 0.983 milliseconds (cumulative count 21792588)
87.500% <= 1.135 milliseconds (cumulative count 25255977)
93.750% <= 1.295 milliseconds (cumulative count 27087691)
96.875% <= 1.463 milliseconds (cumulative count 27945692)
98.438% <= 1.671 milliseconds (cumulative count 28390050)
99.219% <= 2.151 milliseconds (cumulative count 28610996)
99.609% <= 11.231 milliseconds (cumulative count 28723309)
99.805% <= 16.479 milliseconds (cumulative count 28779662)
99.902% <= 20.991 milliseconds (cumulative count 28807714)
99.951% <= 28.623 milliseconds (cumulative count 28821764)
99.976% <= 40.831 milliseconds (cumulative count 28828818)
99.988% <= 46.079 milliseconds (cumulative count 28832330)
99.994% <= 48.767 milliseconds (cumulative count 28834086)
99.997% <= 53.727 milliseconds (cumulative count 28834960)
99.998% <= 61.503 milliseconds (cumulative count 28835402)
99.999% <= 86.335 milliseconds (cumulative count 28835620)
100.000% <= 408.063 milliseconds (cumulative count 28835734)
100.000% <= 4907.007 milliseconds (cumulative count 28835790)
100.000% <= 6356.991 milliseconds (cumulative count 28835840)
100.000% <= 6356.991 milliseconds (cumulative count 28835840)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 564)
0.236% <= 0.303 milliseconds (cumulative count 68134)
2.829% <= 0.407 milliseconds (cumulative count 815775)
10.278% <= 0.503 milliseconds (cumulative count 2963790)
21.496% <= 0.607 milliseconds (cumulative count 6198621)
36.577% <= 0.703 milliseconds (cumulative count 10547284)
53.719% <= 0.807 milliseconds (cumulative count 15490364)
66.494% <= 0.903 milliseconds (cumulative count 19174083)
77.988% <= 1.007 milliseconds (cumulative count 22488556)
85.666% <= 1.103 milliseconds (cumulative count 24702482)
91.030% <= 1.207 milliseconds (cumulative count 26249176)
94.143% <= 1.303 milliseconds (cumulative count 27147010)
96.170% <= 1.407 milliseconds (cumulative count 27731325)
97.340% <= 1.503 milliseconds (cumulative count 28068675)
98.135% <= 1.607 milliseconds (cumulative count 28298165)
98.577% <= 1.703 milliseconds (cumulative count 28425443)
98.857% <= 1.807 milliseconds (cumulative count 28506357)
99.014% <= 1.903 milliseconds (cumulative count 28551441)
99.122% <= 2.007 milliseconds (cumulative count 28582700)
99.193% <= 2.103 milliseconds (cumulative count 28603024)
99.418% <= 3.103 milliseconds (cumulative count 28667976)
99.451% <= 4.103 milliseconds (cumulative count 28677497)
99.490% <= 5.103 milliseconds (cumulative count 28688707)
99.532% <= 6.103 milliseconds (cumulative count 28701032)
99.552% <= 7.103 milliseconds (cumulative count 28706793)
99.555% <= 8.103 milliseconds (cumulative count 28707562)
99.558% <= 9.103 milliseconds (cumulative count 28708493)
99.570% <= 10.103 milliseconds (cumulative count 28711957)
99.603% <= 11.103 milliseconds (cumulative count 28721382)
99.649% <= 12.103 milliseconds (cumulative count 28734528)
99.694% <= 13.103 milliseconds (cumulative count 28747464)
99.740% <= 14.103 milliseconds (cumulative count 28760980)
99.767% <= 15.103 milliseconds (cumulative count 28768621)
99.793% <= 16.103 milliseconds (cumulative count 28776174)
99.825% <= 17.103 milliseconds (cumulative count 28785274)
99.849% <= 18.111 milliseconds (cumulative count 28792203)
99.864% <= 19.103 milliseconds (cumulative count 28796706)
99.884% <= 20.111 milliseconds (cumulative count 28802351)
99.904% <= 21.103 milliseconds (cumulative count 28808175)
99.913% <= 22.111 milliseconds (cumulative count 28810824)
99.924% <= 23.103 milliseconds (cumulative count 28813934)
99.934% <= 24.111 milliseconds (cumulative count 28816747)
99.939% <= 25.103 milliseconds (cumulative count 28818149)
99.943% <= 26.111 milliseconds (cumulative count 28819338)
99.946% <= 27.103 milliseconds (cumulative count 28820265)
99.950% <= 28.111 milliseconds (cumulative count 28821385)
99.952% <= 29.103 milliseconds (cumulative count 28822033)
99.955% <= 30.111 milliseconds (cumulative count 28822832)
99.957% <= 31.103 milliseconds (cumulative count 28823463)
99.959% <= 32.111 milliseconds (cumulative count 28823989)
99.960% <= 33.119 milliseconds (cumulative count 28824349)
99.961% <= 34.111 milliseconds (cumulative count 28824632)
99.963% <= 35.103 milliseconds (cumulative count 28825270)
99.966% <= 36.127 milliseconds (cumulative count 28826046)
99.968% <= 37.119 milliseconds (cumulative count 28826656)
99.970% <= 38.111 milliseconds (cumulative count 28827198)
99.972% <= 39.103 milliseconds (cumulative count 28827728)
99.974% <= 40.127 milliseconds (cumulative count 28828422)
99.977% <= 41.119 milliseconds (cumulative count 28829072)
99.980% <= 42.111 milliseconds (cumulative count 28830055)
99.982% <= 43.103 milliseconds (cumulative count 28830537)
99.984% <= 44.127 milliseconds (cumulative count 28831360)
99.986% <= 45.119 milliseconds (cumulative count 28831865)
99.988% <= 46.111 milliseconds (cumulative count 28832349)
99.990% <= 47.103 milliseconds (cumulative count 28833040)
99.993% <= 48.127 milliseconds (cumulative count 28833819)
99.995% <= 49.119 milliseconds (cumulative count 28834282)
99.996% <= 50.111 milliseconds (cumulative count 28834593)
99.996% <= 51.103 milliseconds (cumulative count 28834721)
99.996% <= 52.127 milliseconds (cumulative count 28834794)
99.997% <= 53.119 milliseconds (cumulative count 28834868)
99.997% <= 54.111 milliseconds (cumulative count 28834969)
99.997% <= 55.103 milliseconds (cumulative count 28835014)
99.998% <= 56.127 milliseconds (cumulative count 28835195)
99.998% <= 57.119 milliseconds (cumulative count 28835219)
99.998% <= 59.103 milliseconds (cumulative count 28835249)
99.998% <= 60.127 milliseconds (cumulative count 28835269)
99.998% <= 61.119 milliseconds (cumulative count 28835392)
99.999% <= 62.111 milliseconds (cumulative count 28835419)
99.999% <= 63.103 milliseconds (cumulative count 28835469)
99.999% <= 64.127 milliseconds (cumulative count 28835478)
99.999% <= 65.119 milliseconds (cumulative count 28835519)
99.999% <= 68.159 milliseconds (cumulative count 28835523)
99.999% <= 69.119 milliseconds (cumulative count 28835552)
99.999% <= 70.143 milliseconds (cumulative count 28835569)
99.999% <= 74.111 milliseconds (cumulative count 28835613)
99.999% <= 75.135 milliseconds (cumulative count 28835619)
99.999% <= 87.103 milliseconds (cumulative count 28835640)
99.999% <= 90.111 milliseconds (cumulative count 28835656)
99.999% <= 91.135 milliseconds (cumulative count 28835690)
100.000% <= 407.295 milliseconds (cumulative count 28835712)
100.000% <= 408.319 milliseconds (cumulative count 28835740)
100.000% <= 4907.007 milliseconds (cumulative count 28835790)
100.000% <= 6356.991 milliseconds (cumulative count 28835840)
100.000% <= 6356.991 milliseconds (cumulative count 28835840)
100.000% <= 6356.991 milliseconds (cumulative count 28835840)
[...]

Summary:
  throughput summary: 47572.75 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.926     0.136     0.783     1.343     1.895  6356.991